docs/test/results/20260321/k6/user-k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: service_capacity.js
        output: -

     scenarios: (100.00%) 1 scenario, 120 max VUs, 40s max duration (incl. graceful stop):
              * stepped_capacity: Up to 120 looping VUs for 35s over 5 stages (gracefulRampDown: 5s, gracefulStop: 30s)


running (01.0s), 013/120 VUs, 1942 complete and 0 interrupted iterations
stepped_capacity   [   3% ] 013/120 VUs  01.0s/35.0s

running (02.0s), 017/120 VUs, 4104 complete and 0 interrupted iterations
stepped_capacity   [   6% ] 017/120 VUs  02.0s/35.0s

running (03.0s), 021/120 VUs, 6540 complete and 0 interrupted iterations
stepped_capacity   [   8% ] 021/120 VUs  03.0s/35.0s

running (04.0s), 025/120 VUs, 8953 complete and 0 interrupted iterations
stepped_capacity   [  11% ] 025/120 VUs  04.0s/35.0s

running (05.0s), 029/120 VUs, 11355 complete and 0 interrupted iterations
stepped_capacity   [  14% ] 029/120 VUs  05.0s/35.0s

running (06.0s), 035/120 VUs, 13556 complete and 0 interrupted iterations
stepped_capacity   [  17% ] 035/120 VUs  06.0s/35.0s

running (07.0s), 041/120 VUs, 15874 complete and 0 interrupted iterations
stepped_capacity   [  20% ] 041/120 VUs  07.0s/35.0s

running (08.0s), 047/120 VUs, 18104 complete and 0 interrupted iterations
stepped_capacity   [  23% ] 047/120 VUs  08.0s/35.0s

running (09.0s), 053/120 VUs, 20366 complete and 0 interrupted iterations
stepped_capacity   [  26% ] 053/120 VUs  09.0s/35.0s

running (10.0s), 059/120 VUs, 22628 complete and 0 interrupted iterations
stepped_capacity   [  28% ] 059/120 VUs  10.0s/35.0s

running (11.0s), 065/120 VUs, 24967 complete and 0 interrupted iterations
stepped_capacity   [  31% ] 065/120 VUs  11.0s/35.0s

running (12.0s), 071/120 VUs, 27063 complete and 0 interrupted iterations
stepped_capacity   [  34% ] 071/120 VUs  12.0s/35.0s

running (13.0s), 077/120 VUs, 29229 complete and 0 interrupted iterations
stepped_capacity   [  37% ] 077/120 VUs  13.0s/35.0s

running (14.0s), 083/120 VUs, 31261 complete and 0 interrupted iterations
stepped_capacity   [  40% ] 083/120 VUs  14.0s/35.0s

running (15.0s), 089/120 VUs, 33171 complete and 0 interrupted iterations
stepped_capacity   [  43% ] 089/120 VUs  15.0s/35.0s

running (16.0s), 095/120 VUs, 35300 complete and 0 interrupted iterations
stepped_capacity   [  46% ] 095/120 VUs  16.0s/35.0s

running (17.0s), 101/120 VUs, 37363 complete and 0 interrupted iterations
stepped_capacity   [  48% ] 101/120 VUs  17.0s/35.0s

running (18.0s), 107/120 VUs, 39542 complete and 0 interrupted iterations
stepped_capacity   [  51% ] 107/120 VUs  18.0s/35.0s

running (19.0s), 113/120 VUs, 41747 complete and 0 interrupted iterations
stepped_capacity   [  54% ] 113/120 VUs  19.0s/35.0s

running (20.0s), 119/120 VUs, 44046 complete and 0 interrupted iterations
stepped_capacity   [  57% ] 119/120 VUs  20.0s/35.0s

running (21.0s), 113/120 VUs, 46150 complete and 0 interrupted iterations
stepped_capacity   [  60% ] 113/120 VUs  21.0s/35.0s

running (22.0s), 105/120 VUs, 48458 complete and 0 interrupted iterations
stepped_capacity   [  63% ] 105/120 VUs  22.0s/35.0s

running (23.0s), 097/120 VUs, 50865 complete and 0 interrupted iterations
stepped_capacity   [  66% ] 097/120 VUs  23.0s/35.0s

running (24.0s), 089/120 VUs, 53019 complete and 0 interrupted iterations
stepped_capacity   [  68% ] 089/120 VUs  24.0s/35.0s

running (25.0s), 081/120 VUs, 55293 complete and 0 interrupted iterations
stepped_capacity   [  71% ] 081/120 VUs  25.0s/35.0s

running (26.0s), 073/120 VUs, 57497 complete and 0 interrupted iterations
stepped_capacity   [  74% ] 073/120 VUs  26.0s/35.0s

running (27.8s), 065/120 VUs, 59618 complete and 0 interrupted iterations
stepped_capacity   [  77% ] 065/120 VUs  27.0s/35.0s

running (30.3s), 057/120 VUs, 61698 complete and 0 interrupted iterations
stepped_capacity   [  80% ] 057/120 VUs  28.0s/35.0s

running (31.3s), 049/120 VUs, 63969 complete and 0 interrupted iterations
stepped_capacity   [  83% ] 049/120 VUs  29.0s/35.0s

running (32.3s), 041/120 VUs, 66289 complete and 0 interrupted iterations
stepped_capacity   [  86% ] 041/120 VUs  30.0s/35.0s

running (33.3s), 033/120 VUs, 68491 complete and 0 interrupted iterations
stepped_capacity   [  88% ] 033/120 VUs  31.0s/35.0s

running (34.3s), 025/120 VUs, 70841 complete and 0 interrupted iterations
stepped_capacity   [  91% ] 025/120 VUs  32.0s/35.0s

running (35.3s), 017/120 VUs, 73162 complete and 0 interrupted iterations
stepped_capacity   [  94% ] 017/120 VUs  33.0s/35.0s

running (36.3s), 009/120 VUs, 75091 complete and 0 interrupted iterations
stepped_capacity   [  97% ] 009/120 VUs  34.0s/35.0s

running (37.3s), 001/120 VUs, 77043 complete and 0 interrupted iterations
stepped_capacity   [ 100% ] 001/120 VUs  35.0s/35.0s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<1500' p(95)=83.02ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 77068   2066.546152/s
    checks_succeeded...: 100.00% 77068 out of 77068
    checks_failed......: 0.00%   0 out of 77068

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=29.36ms min=713.18µs med=18.55ms max=1.57s    p(90)=68.02ms p(95)=83.02ms p(99)=107.82ms
      { expected_response:true }...: avg=29.36ms min=713.18µs med=18.55ms max=1.57s    p(90)=68.02ms p(95)=83.02ms p(99)=107.82ms
    http_req_failed................: 0.00%  0 out of 77068
    http_reqs......................: 77068  2066.546152/s

    EXECUTION
    iteration_duration.............: avg=27.55ms min=757.94µs med=18.61ms max=174.62ms p(90)=67.79ms p(95)=82.51ms p(99)=105.52ms
    iterations.....................: 77068  2066.546152/s
    vus............................: 1      min=1          max=119
    vus_max........................: 120    min=120        max=120

    NETWORK
    data_received..................: 45 MB  1.2 MB/s
    data_sent......................: 7.8 MB 209 kB/s



running (37.3s), 000/120 VUs, 77068 complete and 0 interrupted iterations
stepped_capacity ✓ [ 100% ] 000/120 VUs  35s